# THIS FILE IS AUTOMATICALLY GENERATED
# Project: D:\Dropbox\IoT Development\Cypress PSoC Development\RTD Design.cydsn\RTD Design.cyprj
# Date: Fri, 09 Jun 2017 18:52:01 GMT
#set_units -time ns
create_clock -name {ADC_SAR_SEQ_intClock(FFB)} -period 541.66666666666663 -waveform {0 270.833333333333} [list [get_pins {ClockBlock/ff_div_10}]]
create_clock -name {SPIS_SCBCLK(FFB)} -period 125 -waveform {0 62.5} [list [get_pins {ClockBlock/ff_div_5}]]
create_clock -name {CyRouted1} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySYSCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {ADC_SAR_SEQ_intClock} -source [get_pins {ClockBlock/hfclk}] -edges {1 13 27} -nominal_period 541.66666666666663 [list]
create_generated_clock -name {SPIS_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 3 7} [list]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for D:\Dropbox\IoT Development\Cypress PSoC Development\RTD Design.cydsn\TopDesign\TopDesign.cysch
# Project: D:\Dropbox\IoT Development\Cypress PSoC Development\RTD Design.cydsn\RTD Design.cyprj
# Date: Fri, 09 Jun 2017 18:51:57 GMT
